announcements/company-emacspeak.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Emacspeak And Company: Complete Anything Front-End For Emacspeak</title>
<!-- 2014-05-27 Tue 08:51 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="T.V Raman" />
</head>
<body>
<div id="content">
<h1 class="title">Emacspeak And Company: Complete Anything Front-End For Emacspeak</h1>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Emacspeak And Company: Complete Anything Front-End For Emacspeak</h2>
<div class="outline-text-2" id="text-1">
<p>
Module <a href="http://emacspeak.googlecode.com/svn/trunk/lisp/emacspeak-company.el">emacspeak-company</a> speech-enables package 
<a href="http://www.emacswiki.org/emacs/CompanyMode">Company</a> — a  flexible <b>complete-anything</b>   extension for Emacs.
Package <i>company</i> gains much of its flexibility by providing an
extensible framework for both back-ends and front-ends; back-ends
are responsible for  language-specific support e.g., <b>C++</b> vs
<b>Emacs Lisp</b>; front-ends can provide different <i>visualizations</i>
of the available completions.
</p>

<p>
I started using package <b>company</b> as I taught myself to program
in <a href="http://golang.org">Go</a>  over the last couple of weeks, and package
<b>emacspeak-company</b>  was one of the bi-products.
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Using Company With Emacspeak</h3>
<div class="outline-text-3" id="text-1-1">
<p>
You can turn on <i>company-mode</i> in dividual buffers; you can also
turn it on globally. Company comes pre-packaged with backend
support for many programming languages; for programming in Go, I
use module <i>company-go</i> in conjunction with the <a href="http://github.com/nsf/gocode">GoCode</a> tool.
</p>

<p>
See customization group <i>company</i>  to customize package
<i>company</i>;
Emacspeak loads package <i>emacspeak-company</i>  when package
<i>company</i> is loaded, and that automatically sets up the
<b>Emacspeak</b> front-end.
</p>

<p>
Once activated, package <i>company</i> shows available completions
where available once you type a prescribed number of
characters. Available candidates are displayed visually via an
overlay and can be traversed using either the <span class="underline">up/down</span> arrows or
keys <span class="underline">M-n</span> and <span class="underline">M-p</span>. You can also search and filter the
available completions, see documentation for command
<span class="underline">company-mode</span>. The available visual front-ends also display
relevant metadata for the current candidate in the echo
area. 
</p>

<p>
Front-end <i>emacspeak-company</i> performs the following additional
actions:
</p>

<ul class="org-ul">
<li>Speaks current candidate along with the relevant metadata.
</li>
<li>The metadata is spoken using  <span class="underline">voice-annotate</span>.
</li>
<li>Auditory icon <span class="underline">help</span> indicates  that  completion has started.
</li>
<li>pressing <span class="underline">F1</span> during completion displays documentation for
the current candidate.
</li>
<li>You can choose the current candidate by pressing <span class="underline">RET</span>; this
</li>
</ul>
<p>
speaks the selected candidate.
</p>
<ul class="org-ul">
<li>Auditory icon <span class="underline">close-object</span> indicates that completion has finished.
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Insights From Speech-Enabling Company</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Company uses a fluid visual interface to display completions
without the user having to switch contexts — it achieves this by
using overlays that appear briefly in the form of a conceptual
tooltip. These pseudo tooltips are created and destroyed via a
timer; keyboard interaction causes these to be updated —
including hiding the tooltip where appropriate.
</p>

<p>
Module <i>emacspeak-company</i>   speech-enables this interface by
examining the underlying information used to create the
visualization  to produce an effective audio-formatted representation.
The net effect is that you can write code with completion helping
you along the way; you do not need  to switch tasks to lookup
details  as to what completions are available.
</p>
</div>
</div>
<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Acknowledgements</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Thanks again to the authors of package <i>company</i> for a really
nice tool —  it's a real productivity winner — especially when
learning a new language and its built-in packages.
</p>

<p>
I found these articles really helpful while learning to write
package <i>emacspeak-company</i>.
</p>
<ul class="org-ul">
<li><a href="http://yousefourabi.com/blog/2014/05/emacs-for-go/">Setting Up GoMode</a>
</li>
<li><a href="http://dominik.honnef.co/posts/2013/08/writing_go_in_emacs__cont__/">Writing Go In Emacs</a>
</li>
</ul>


<p>
Learning Go was a pleasure (it's still a pleasure &#x2014; I'm still
learning:-))
and the documentation on <a href="http://golang.org">GoLang</a>  is excellent. As an added bonus,
that entire site uses clean, well-formed HTML  without any
unnecessary  artifacts that make so much of today's Web a  giant
mess; I have been able to use Emacs/EWW exclusively while working
with <i>golang.org</i>  — a real bonus for someone programming heavily
in Emacs.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: <span class="timestamp-wrapper"><span class="timestamp">&lt;2014-05-27 Tue&gt;</span></span></p>
<p class="author">Author: T.V Raman</p>
<p class="date">Created: 2014-05-27 Tue 08:51</p>
<p class="creator">Emacs 24.3.91.1 (Org mode 8.2.6)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
